cases/ansys_verification/VMFL038/case/constant/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object momentumTransport; }
// Laminar. Carried for solver-version robustness alongside momentumTransport.
simulationType  laminar;
