cases/ansys_verification/VMFL038/case/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    p { solver GAMG; smoother GaussSeidel; tolerance 1e-10; relTol 0.01; }
    U { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-11; relTol 0.1; }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;
    // The solve TERMINATES on this residual criterion strictly before endTime. For a
    // steady solve, last Time == endTime means it ran out of clock WITHOUT converging
    // -- the opposite of completion (PREREGISTRATION sec.6).
    //
    // residualControl is on p ONLY, and that is a DELIBERATE, FEASIBILITY-VERIFIED
    // choice, not an omission: the transverse velocity Uy is machine-zero in this
    // developed unidirectional film (feasibility: max|Uy| = 3.4e-12 m/s), so its
    // NORMALISED residual is a 0/0 artifact that floors near 1e-3 and can never trip
    // any tolerance -- a run controlled on U would ALWAYS reach endTime and be graded
    // NOT A RESULT for a reason that is pure bookkeeping. p is the physical driver;
    // when p is converged the pressure-driven Ux is developed. The comparator
    // INDEPENDENTLY confirms the streamwise momentum is settled by requiring the final
    // Ux initial residual below ITER_RES_FLOOR (grade_vmfl038.py), so p-only control
    // is not taken on trust. Feasibility at Ny=40: converged in 2093 iters, last Ux
    // initial residual 7.9e-7.
    residualControl { p 1e-10; }
}
relaxationFactors { equations { U 0.9; p 0.9; } }
